 /*
 *  app_gpio.c
 *
 *  Created on: 2023年07月17日
 *      Author: lwp
 */
#ifndef _APP_GPIO_H_
#define _APP_GPIO_H_
 
/*
********************************************************************************
********************************************************************************
*/ 
typedef struct GPIO {
    char       *name;
    rt_base_t   num;           /* 引脚的编号 */
    rt_base_t   mode;          /* pin模式 */
} gpio_t;

typedef enum gpio_pin_e {
    LED_SYS_PIN    =  0 ,  // PD15 系统指示灯
} gpio_pin_t;
/*
********************************************************************************
********************************************************************************
*/ 
#endif /* _APP_GPIO_H_ */

